# 1. Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
# Дано a, b, c - стороны предполагаемого треугольника. Требуется сравнить длину каждого
# отрезка-стороны с суммой двух других. Если хотя бы в одном случае отрезок окажется
# больше суммы двух других, то треугольника с такими сторонами не существует.
# Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним.

a, b, c = map(float, input("Введите длины сторон треугольника через запятую без пробелов: ").split(","))
if a < b + c and b < a + c and c < b + a:
    print("Треугольник существует", end=' ')
    if a == b and b == c and c == a:
        print("и равносторонний")
    elif a == b  or a == c or b == c:
        print("и равнобедренный")
    else:
        print("и разносторонний")
else:
    print("триугольника не существует")

# Напишите код, который запрашивает число и сообщает является ли оно простым или составным.
# Используйте правило для проверки: “Число является простым, если делится нацело только на единицу и на себя”.
# Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.

minimum = 0
maximum = 100000
while True:
    num = int(input("Введите число: "))
    if num > minimum or num <= maximum:
        remainder = 0
        for i in range(1, num+1):
            if num % i == 0:
                remainder += 1
        if remainder > 2:
            print("число составное")
        else:
            print("число простое")
        break
    print(f"Введите число от {minimum} до {maximum}")

# Программа загадывает число от 0 до 1000. Необходимо угадать число за 10 попыток.
# Программа должна подсказывать “больше” или “меньше” после каждой попытки. Для генерации случайного числа используйте код:
# from random import randint num = randint(LOWER_LIMIT, UPPER_LIMIT)
from random import randint
LOWER_LIMIT = 0
UPPER_LIMIT = 1001
num = randint(LOWER_LIMIT, UPPER_LIMIT)
trys = 0

while trys < 10:
    user_num = int(input(f"Введите целое число от {LOWER_LIMIT} до {UPPER_LIMIT-1}: "))
    if user_num > num:
        print("меньше")
    elif user_num < num:
        print("больше")
    else:
        print("Вы угадали!")
        break
    trys += 1
else:
    print("Вы исчерпали количество попыток")




